## Creating a series from a list,which is the most important data structure in python. 1)First we import pandas and numpy libraries 2)Declare a series using method syntax and pass a list as an argument 3) print the series

In [1]:
import numpy as np
import pandas as pd

In [2]:
import math
print (float('nan'))
print(type(float('nan')))

nan
<class 'float'>

In [3]:
import math
print(math.isnan(float('nan')))

print(math.isnan(np.nan))

True
True

In [4]:
#use pd.series syntax to create a series and pass a list as an argument
my_first_series = pd.Series(list('ilovepython'))

In [5]:
print(my_first_series)

0     i
1     l
2     o
3     v
4     e
5     p
6     y
7     t
8     h
9     o
10    n
dtype: object

## the left side of the out shows the index which is automatically assigned to the data elements. the data type is shown as an object,as the list was passed as an object

## We will create a series from a  numpy array --Array in Numpy is a table of elements (usually numbers), all of the same type, indexed by a tuple of positive integers. In Numpy, number of dimensions of the array is called rank of the array.A tuple of integers giving the size of the array along each dimension is known as shape of the array. An array class in Numpy is called as ndarray.

In [6]:
# basic array characteristics
import numpy as np
 
# Creating array object
my_first_array = np.array( [[ 10, 12, 13],
                 [ 14, 19, 18]] )
 
# Printing type of arr object
print(type(my_first_array))
 
# Printing array dimensions (axes)
print("No. of dimensions: ", my_first_array.ndim)
 
# Printing shape of array
print("Shape of array: ", my_first_array.shape)
 
# Printing size (total number of elements) of array
print("Size of array: ", my_first_array.size)

<class 'numpy.ndarray'>
No. of dimensions:  2
Shape of array:  (2, 3)
Size of array:  6

## Dictionaries are used to store data values in key:value pairs.A dictionary is a collection which is ordered*, changeable and do not allow duplicates.Dictionaries are written with curly brackets, and have keys and values:

In [17]:
my_first_dict = {
  "Name": "Madhu",
  "Gender": "Female",
  "Language": "German",

    
}
print(my_first_dict)
from collections import OrderedDict
ordered_dict = OrderedDict({"Name": "Madhu",
  "Gender": "Female",
  "Language": "German",
   
})
print(ordered_dict)

{'Name': 'Madhu', 'Gender': 'Female', 'Language': 'German'}
OrderedDict([('Name', 'Madhu'), ('Gender', 'Female'), ('Language', 'German')])

## There are four collection data types in the Python programming language:1)List is a collection which is ordered and changeable. Allows duplicate members.2)Tuple is a collection which is ordered and unchangeable. Allows duplicate members.3)Set is a collection which is unordered, unchangeable*, and unindexed. No duplicate members.4)Dictionary is a collection which is ordered** and changeable. No duplicate members.

### <b><font color="green">A note on OrderedDict</font>: In older versions of python ( versions less than 3.6), the dictionaries were not ordered. In those python versions, if order of the keys need to be preserved, then the only option was to use the class OrderedDict. From version 3.6 and beyond, the dictionaries are by default orderd, hence there is not need to explicitly use OrderedDict. OrderedDict still can be used for the additional values that it provides.</b>

 Some features of OrderedDict still made it valuable and different from a regular dict:

  <ul> <li> Intent signaling: If you use OrderedDict over dict, then your code makes it clear that the order of items in the dictionary is important. Youâ€™re clearly communicating that your code needs or relies on the order of items in the underlying dictionary.</li>
    <li>Control over the order of items: If you need to rearrange or reorder the items in a dictionary, then you can use .move_to_end() and also the enhanced variation of .popitem().</li>
    <li>Equality test behavior: If your code compares dictionaries for equality, and the order of items is important in that comparison, then OrderedDict is the right choice.</li>
    </ul>

In [18]:
#Scalar input as a series
scalar_series = pd.Series(5.,index=['a','b','c','d','e'])
print(scalar_series)

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [19]:
##Accesing elements in a series

## Differences between loc and ilocThe main distinction between loc and iloc is:
loc is label-based, which means that you have to specify rows and columns based on their row and column labels.
iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position).

In [20]:
# importing pandas and numpy
import pandas as pd
import numpy as np

# create a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'segment' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})
data

   age segment     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [21]:
## select with multiple conditions
data.loc[(data.age >= 21) & (data.gender == 'M')]

   age segment   city gender favourite_color
3   21       B  Delhi      M             NaN

In [22]:
#Select a range of rows using loc
#slice
data.loc[3:5]

   age segment    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black
5   11       A   Delhi      M           green

In [23]:
data[1:3]  # No loc mentioned

   age segment    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow

In [33]:
data.iloc[0,2] # value on row index 0 and column with index 2

'Gurgaon'

In [34]:
#Select rows with indices using iloc
# select rows with indexes
data.iloc[[0,2]]

   age segment     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       C   Mumbai      F          yellow

In [35]:
#Select rows with indices using iloc
# select rows with indexes
data.iloc[[0,1,6]]

   age segment     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
6   17       A   Mumbai      F             red

In [36]:
# select rows with particular indexes and particular columns
data.iloc[[0,2],[1,3]]

  segment gender
0       A      M
2       C      F

In [ ]:
#Select a range of rows using iloc
# select a range of rows
data.iloc[1:3]

   age segment    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow

In [14]:
#Vectorised operation in series
vec1 = pd.Series([1,2,3,4],index=['a','b','c','d'])
vec2 = pd.Series([10,20,30,40],index=['a','b','c','d'])

In [15]:
#adding both[ we get index wise sum]
vec1+vec2

a    11
b    22
c    33
d    44
dtype: int64

In [16]:
#Now we change the index of vec2
vec1 = pd.Series([1,2,3,4],index=['a','b','c','d'])
vec2 = pd.Series([10,20,30,40],index=['a','d','b','c'])

In [17]:
vec1+vec2   #the summation value changes as the data element is bound to the index position

a    11
b    32
c    43
d    24
dtype: int64

In [18]:
#Create a dataframe from lists
import pandas as pd

In [19]:
#Create Dataframe from a Dict with equal length lists
#we create a dataframe with last five olympics data which has place,year,number of countries that participated
olympic_data_list = {'City':['London','Beijing','Athens','Sydney','Atlanta'],
                     'Year':[2012,2008,2004,2000,1996],
                     'No of Participating Countries':[205,204,201,200,197]
                     }

In [20]:
df_olympic_data = pd.DataFrame(olympic_data_list)

In [21]:
df_olympic_data

      City  Year  No of Participating Countries
0   London  2012                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197

In [16]:
#Creating Dataframe from a Dict

my_data = {'Name':['Joe','John','Nancy'],
           'Age':[26,27,28],
            'Sex':['Male','Male','Female']
          }

In [17]:
my_df = pd.DataFrame(my_data)

In [18]:
my_df

    Name  Age     Sex
0    Joe   26    Male
1   John   27    Male
2  Nancy   28  Female

In [19]:
#we can selectively view a dataframe by referring to a column or with describe function
my_df.Name

0      Joe
1     John
2    Nancy
Name: Name, dtype: object

In [20]:
#To view entire dataframe properties
my_df.describe()     #only numeric values(columns) will get displayed

        Age
count   3.0
mean   27.0
std     1.0
min    26.0
25%    26.5
50%    27.0
75%    27.5
max    28.0

In [26]:
my_df.describe(include='all') #for all columns in the dataframe

       Name   Age   Sex
count     3   3.0     3
unique    3   NaN     2
top     Joe   NaN  Male
freq      1   NaN     2
mean    NaN  27.0   NaN
std     NaN   1.0   NaN
min     NaN  26.0   NaN
25%     NaN  26.5   NaN
50%     NaN  27.0   NaN
75%     NaN  27.5   NaN
max     NaN  28.0   NaN

In [37]:
#creating a dataframe from a dict of series
olympic_series_participation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                                  index=[2012,2008,2004,2000,1996])

In [38]:
df_olympic_series = pd.DataFrame({'No Of Participating Countries':olympic_series_participation,
                                 'Host Cities':olympic_series_country})

In [39]:
df_olympic_series

      No Of Participating Countries Host Cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [30]:
#creating dataframe from ndarray
import numpy as np
nd_array = np.array([2012,2011,2010,2009])
dict_nd_array = {'year' : nd_array}
df_array = pd.DataFrame(dict_nd_array)
df_array

   year
0  2012
1  2011
2  2010
3  2009

## Pandas-view and select data

In [31]:
#creating a dataframe from a dict of series
olympic_series_participation = pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country = pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],
                                  index=[2012,2008,2004,2000,1996])
df_olympic_series = pd.DataFrame({'No Of Participating Countries':olympic_series_participation,
                                 'Host Cities':olympic_series_country})

df_olympic_series

      No Of Participating Countries Host Cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

## view

In [32]:
#to view the contents of a df,use the function describe
df_olympic_series.describe

<bound method NDFrame.describe of       No Of Participating Countries Host Cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta>

In [27]:
#view only top 2 records
df_olympic_series.head()

      No Of Participating Countries Host Cities
2012                            205      London
2008                            204     Beijing
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [34]:
#view the bottom 3 rows
df_olympic_series.tail(3)

      No Of Participating Countries Host Cities
2004                            201      Athens
2000                            200      Sydney
1996                            197     Atlanta

In [40]:
#to view the index
df_olympic_series.index

Int64Index([2012, 2008, 2004, 2000, 1996], dtype='int64')

In [41]:
#select the columns
df_olympic_series.columns

Index(['No Of Participating Countries', 'Host Cities'], dtype='object')

## select

In [42]:
#select data for host cities
df_olympic_series['Host Cities']

2012     London
2008    Beijing
2004     Athens
2000     Sydney
1996    Atlanta
Name: Host Cities, dtype: object

In [43]:
#to select the countries
df_olympic_series['No Of Participating Countries']

2012    205
2008    204
2004    201
2000    200
1996    197
Name: No Of Participating Countries, dtype: int64

In [39]:
#select data based on label or index using loc 
df_olympic_series.loc[2000]

No Of Participating Countries       200
Host Cities                      Sydney
Name: 2000, dtype: object

In [44]:
#using the integer-location based indexing by position(slicing)
df_olympic_series.iloc[0:2]    # in this case the result we will get is for the 1st(0) and second (1) records

      No Of Participating Countries Host Cities
2012                            205      London
2008                            204     Beijing

In [45]:
#Integer-location based data selection based on index value
df_olympic_series.iat[3,1]       #3rd row(index=4) and 2nd col(index=1)

'Sydney'

## Missing values

In [42]:
#Lets first take two vectorised series
#Vectorised operation in series
vec1 = pd.Series([1,2,3,4],index=['a','b','c','d'])
vec2 = pd.Series([10,20,30,40],index=['a','b','f','g'])  #as two indexes are different,we will get NAN values on addition
sumofseries = vec1+vec2
sumofseries

a    11.0
b    22.0
c     NaN
d     NaN
f     NaN
g     NaN
dtype: float64

## Lets check how to fix the NAN values

In [43]:
sumofseries

a    11.0
b    22.0
c     NaN
d     NaN
f     NaN
g     NaN
dtype: float64

In [44]:
#To drop the NaN(NOT A NUMBER)values from the dataset,we use a function called drop.na
dropna_s = sumofseries.dropna()

In [45]:
dropna_s

a    11.0
b    22.0
dtype: float64

## Fillna function

In [46]:
#the fillna function fills all the uncommon indices with a number before dropping them
sumofseries.fillna(0)

a    11.0
b    22.0
c     0.0
d     0.0
f     0.0
g     0.0
dtype: float64

In [47]:
#Fora good practice fill the  NaN values with 0 before performing a sum
fill_na_before_sum = vec1.add(vec2,fill_value =0) # in this example vec2 had NaN values

In [48]:
fill_na_before_sum

a    11.0
b    22.0
c     3.0
d     4.0
f    30.0
g    40.0
dtype: float64

## Data Operations

In [28]:
import pandas as pd

In [29]:
#we declare a movie rating dataframe --rating from 1 to 5
df_movie_rating = pd.DataFrame({'movie1': [5,4,3,3,2,1],
                               'movie2': [4,5,2,3,4,2]},
                               index=['Tom','Jeff','Peter','Ram','Ted','Paul']
)

In [30]:
df_movie_rating

       movie1  movie2
Tom         5       4
Jeff        4       5
Peter       3       2
Ram         3       3
Ted         2       4
Paul        1       2

## while performing data operation,custom functions can be applied with the applymap method

In [52]:
#we define the custom function first
def movie_grade(rating):
    if rating ==5:
        return 'A'
    if rating ==4:
        return 'B'
    if rating ==3:
        return 'C'
    if rating==2:
        return 'D'
    else:
        return 'F'

In [53]:
print (movie_grade(5))

A

In [54]:
#using applymap method
df_movie_rating.applymap(movie_grade)

      movie1 movie2
Tom        A      B
Jeff       B      A
Peter      C      D
Ram        C      C
Ted        D      B
Paul       F      D

## Statistical functions

In [49]:
df_test_scores = pd.DataFrame({'Test1':[78,88,86,85,45],
                               "Test2":[56,67,72,77,66]},
                              index= ['A','B','C','D','E']
                              
    


)

In [56]:
df_test_scores.max()

Test1    88
Test2    77
dtype: int64

In [57]:
df_test_scores.mean()

Test1    76.4
Test2    67.6
dtype: float64

In [58]:
df_test_scores.std()

Test1    17.952716
Test2     7.829432
dtype: float64

In [32]:
#Data Operation using GROUP BY
df_student_name = pd.DataFrame({'first':['sim','tim','kim','sim'],
                                'last' :['khan','jones','cruise','paul']
    
})

In [33]:
df_student_name

  first    last
0   sim    khan
1   tim   jones
2   kim  cruise
3   sim    paul

In [35]:
#we first group the names by the first name
grouped = df_student_name.groupby('first')
grouped

In [42]:
grouped2 = df_student_name.groupby("last")
grouped2

In [36]:
grp_result = grouped.get_group('sim')

In [43]:
grp_result2 = grouped2.get_group('khan')

In [44]:
grp_result2

  first  last
0   sim  khan

In [37]:
grp_result

  first  last
0   sim  khan
3   sim  paul

In [45]:
#sorting by the first names
df_student_name.sort_values('first')

  first    last
2   kim  cruise
0   sim    khan
3   sim    paul
1   tim   jones

In [50]:
##STANDARDIZATION
#create a function to return standardized value
def standardize_test(test):
    return (test-test.mean())/test.std()

In [51]:
#Now we apply the function on test1
standardize_test(df_test_scores['Test1'])

A    0.089123
B    0.646142
C    0.534738
D    0.479036
E   -1.749039
Name: Test1, dtype: float64

## Additional data operations

In [67]:
import pandas as pd

In [52]:
#create student data with math data
df_student_math = pd.DataFrame({'student':['A','B','C','D','E','F'],
                                'ID':[10,11,12,13,14,15]
    
})

In [53]:
df_student_science = pd.DataFrame({'student':['D','E','F'],
                                'ID':[13,17,15]})

In [54]:
#We will MERGE both the datasets to form a single data file
pd.merge(df_student_math,df_student_science)   #ONLY COMMON NAMES WITH COMMON MARKS WILL BE MERGED

  student  ID
0       D  13
1       F  15

In [55]:
#Merging with student key
pd.merge(df_student_math,df_student_science,on='student')  #common student names will be merged

  student  ID_x  ID_y
0       D    13    13
1       E    14    17
2       F    15    15

In [56]:
#merge with a left join,with ID as key and fill NaN values with X
pd.merge(df_student_math,df_student_science,on='ID',how='left').fillna('X')

  student_x  ID student_y
0         A  10         X
1         B  11         X
2         C  12         X
3         D  13         D
4         E  14         X
5         F  15         F

In [57]:
#Concatenating both the dataframes
pd.concat([df_student_math,df_student_science],ignore_index=True)

  student  ID
0       A  10
1       B  11
2       C  12
3       D  13
4       E  14
5       F  15
6       D  13
7       E  17
8       F  15

In [74]:
#Creating a new df with student survey data
df_survey_data= pd.DataFrame({'student':['A','B','B','D','E','F'],
                                'ID':[10,11,11,13,14,15]})

In [75]:
df_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [76]:
#Now we drop the duplicates by taking student as key
df_survey_data.drop_duplicates('student')

  student  ID
0       A  10
1       B  11
3       D  13
4       E  14
5       F  15

In [58]:
#Reindexing in Pandas can be used to change the index of rows and columns of a DataFrame.
# import numpy and pandas module
import pandas as pd
import numpy as np
 
column = ['a', 'b', 'c', 'd', 'e']
index = ['A', 'B', 'C', 'D', 'E']
  
# create a dataframe of random values of array
df1 = pd.DataFrame(np.random.rand(5, 5),
        columns = column, index = index)
 
# create the new index for rows
new_index =['U', 'A', 'B', 'C', 'Z']
 
print(df1.reindex(new_index))

          a         b         c         d         e
U       NaN       NaN       NaN       NaN       NaN
A  0.250423  0.232317  0.647887  0.393790  0.795324
B  0.135148  0.009664  0.538005  0.579113  0.797542
C  0.747002  0.912826  0.424575  0.576218  0.029812
Z       NaN       NaN       NaN       NaN       NaN

In [ ]:
#data alignment is intrinsic" in pandas

## In pandas, align doesnâ€™t concatenate the dataframe, it rather aligns them so that the new dataframes have the same row and column configuration. If the dataframes have different columns, pandas creates the column and fills with NaN values.

In [2]:
df1 = pd.DataFrame([[10,20,60], [30,40,60]], columns=['A', 'B', 'H'], index=[1,2])
df2 = pd.DataFrame([[10,20,30], [60,70,80], [100,200,300]], columns=['A', 'B', 'C'], index=[2,3,4])
df1

    A   B   H
1  10  20  60
2  30  40  60

In [3]:
df2

     A    B    C
2   10   20   30
3   60   70   80
4  100  200  300

In [4]:
af1,af2 = df1.align(df2, join='outer', axis=1) #and axis=1 means that the function is applied row-wise on the DataFrame.

In [5]:
af1        #A full outer join returns all the rows from the left dataframe, 
             #all the rows from the right dataframe, and matches up rows where possible, with NaNs elsewhere.

    A   B   C   H
1  10  20 NaN  60
2  30  40 NaN  60

In [6]:
af2

     A    B    C   H
2   10   20   30 NaN
3   60   70   80 NaN
4  100  200  300 NaN

In [7]:
#concatenating the dataframes df1 and df2 and af1 and af2 respectively
pd.concat([df1,df2],axis=0) #axis=0 represents the function is applied column-wise

     A    B     H      C
1   10   20  60.0    NaN
2   30   40  60.0    NaN
2   10   20   NaN   30.0
3   60   70   NaN   80.0
4  100  200   NaN  300.0

In [8]:
pd.concat([af1,af2],axis=0)

     A    B      C     H
1   10   20    NaN  60.0
2   30   40    NaN  60.0
2   10   20   30.0   NaN
3   60   70   80.0   NaN
4  100  200  300.0   NaN

## If you notice above, the outputs are just same. Align serves the purpose of creating dataframes that looks like just a split of concatenated output.